scr1c/InformationRegisters/ОчередьСообщенийОтправка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСообщенийОтправка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>111</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетчикОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>идСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

scr1c/InformationRegisters/ОчередьСообщенийОтправка/Ext/ManagerModule.bsl
Процедура ЗаписатьВОчередь(емайл,Тема,Текст) Экспорт
	
	Зап = РегистрыСведений.ОчередьСообщенийОтправка.СоздатьМенеджерЗаписи();
	Зап.идСообщения = новый УникальныйИдентификатор;
	Зап.Получатель = емайл;
	Зап.Тема = Тема;
	Зап.ТекстСообщения = Текст;
	Зап.Записать();
	
	
КонецПроцедуры      

Процедура ОбработатьОчередь() Экспорт
	
	Наб = РегистрыСведений.ОчередьСообщенийОтправка.СоздатьНаборЗаписей();
	наб.Прочитать();      
	Если Наб.Количество() = 0 ТОгда Возврат; КонецЕслИ;
	
	Для а=-Наб.Количество() по -1 Цикл
		Зап = Наб[-а-1];    
		Если Зап.СчетчикОшибок>= 3 Тогда Продолжить; КонецЕсли;
		
		рез = Истина;
		Если ЗначениеЗаполнено(Зап.Получатель) Тогда      
			
			
			ТекстОшибки = "";
			рез = глПочта.Почта(Зап.Получатель,Зап.Тема,Зап.ТекстСообщения,ТекстОшибки);	
			
			Если рез = ложь Тогда
				Зап.ТекстОшибки = ""+ТекстОшибки;
				Зап.СчетчикОшибок = Зап.СчетчикОшибок + 1;
			КонецЕсли;
			
		КонецесЛИ; 
		
		Если Рез=Истина Тогда
			Наб.Удалить(-а-1);   
		КонецЕсли;  
		
	КонецЦикла;           
	
	Наб.Записать();
	                  
КонецПроцедуры
